{
  "universityLogo": "http://tiny.cc/xwxr001",
  "university": "Peking University",
  "courses": [
        {"course": "Mathematics","program":"Bachelor Degree","link":"https://english.math.pku.edu.cn/Undergraduate/index.htm","entryRequirements":"Non-Chinese citizen; age ~18–25; high-school (SMA/SMU) diploma or equivalent (original or notarized copy); academic transcripts; two recommendation letters; personal statement; passport; meet one accepted standardized route (SAT ≥1400 OR IB/A-Level/ACT meeting PKU thresholds) or pass PKU secondary assessment; Chinese-taught tracks typically require HSK6 (≥210). Documents must be in English or Chinese (notarized translation otherwise). Indonesian applicants should provide notarized SMA diploma/transcripts and passport copy, plus any SAT/IB/A-Level results if available.","duration":"4 years full-time (standard; program allows 4–6 years)","fees":"Science/Engineering major range: RMB 30,000 per academic year (PKU published rate for science & engineering undergrads); check dept. for exact fee.","courseDetail":"https://isd.pku.edu.cn/en/undergraduate_program.php","otherInstitution":"http://tiny.cc/qxxr001","scholarship":"https://isd.pku.edu.cn/en/scholarship.php"},
        {"course": "Probability and Statistics","program":"Bachelor Degree","link":"https://english.math.pku.edu.cn/Undergraduate/index.htm","entryRequirements":"Same PKU undergraduate international requirements: non-Chinese citizen, high-school diploma (SMA/SMU) or equivalent, transcripts, recommendations, statement, passport; standardized test route (SAT/IB/A-Level/ACT) or PKU secondary exam; Chinese-taught tracks expect HSK6 (≥210). Indonesian applicants should prepare notarized SMA documents and language/test scores as applicable.","duration":"4 years full-time (standard; can extend to 6 years)","fees":"RMB 30,000 per academic year (Science/Math category — confirm with department for any program-specific differences).","courseDetail":"https://isd.pku.edu.cn/en/undergraduate_program.php","otherInstitution":"http://tiny.cc/jyxr001","scholarship":"https://isd.pku.edu.cn/en/scholarship.php"},
        {"course": "Scientific and Engineering Computing","program":"Bachelor Degree","link":"https://english.math.pku.edu.cn/Undergraduate/index.htm","entryRequirements":"PKU international undergrad rules: non-Chinese passport, SMA diploma or equivalent, transcripts, 2 recommendation letters, personal statement, passport; admission via standardized test exemption (SAT/IB/A-Level/ACT meeting thresholds) or department exam; Chinese-taught tracks require HSK6 (≥200–210 depending on discipline). Indonesian applicants: bring notarized SMA transcripts and any SAT/IB/A-Level results; prepare HSK if applying for Chinese-taught instruction.","duration":"4 years full-time (standard; can extend to 4–6 years)","fees":"RMB 30,000 per academic year (Science/Engineering category).","courseDetail":"https://isd.pku.edu.cn/en/undergraduate_program.php","otherInstitution":"http://tiny.cc/nyxr001","scholarship":"https://isd.pku.edu.cn/en/scholarship.php"},
        {"course": "Informatics","program":"Bachelor Degree","link":"https://english.math.pku.edu.cn/Undergraduate/index.htm","entryRequirements":"Follow PKU international undergraduate application prerequisites: non-Chinese citizenship, valid passport, high-school diploma (notarized), transcripts, 2 recommendations, personal statement, and one accepted entrance qualification (SAT/IB/A-Level/ACT) or pass PKU secondary exam; language: Chinese-taught tracks require HSK6 (≥210) while some interdisciplinary/EECS-taught options may accept English proficiency proof.","duration":"4 years full-time (standard; program allows up to 6 years)","fees":"RMB 30,000 per academic year (Science & Engineering band).","courseDetail":"https://isd.pku.edu.cn/en/undergraduate_program.php","otherInstitution":"http://tiny.cc/ryxr001","scholarship":"https://isd.pku.edu.cn/en/scholarship.php"},
        {"course": "Financial Mathematics","program":"Bachelor Degree","link":"https://english.math.pku.edu.cn/Undergraduate/index.htm","entryRequirements":"PKU international undergrad requirements apply: SMA diploma or equivalent (original/notarized), transcripts, 2 recommendation letters, personal statement, passport; standardized test routes (SAT/IB/A-Level/ACT) OR departmental assessment; Chinese instruction normally requires HSK6 (≥210). Indonesian applicants: provide notarized SMA documents and any national exam results if relevant; consider submitting SAT/IB/A-Level to strengthen application.","duration":"4 years full-time (standard)","fees":"RMB 30,000 per academic year (Science/Engineering/Math category); verify with department for any variations.","courseDetail":"https://isd.pku.edu.cn/en/undergraduate_program.php","otherInstitution":"http://tiny.cc/qxxr001","scholarship":"https://isd.pku.edu.cn/en/scholarship.php"},
        {"course": "Data Science and Big Data Technology","program":"Bachelor Degree","link":"https://eecs.pku.edu.cn/xxkxjsxy/Home/Academics/Undergraduate_Programs.htm","entryRequirements":"International applicants (including from Indonesia) must meet PKU undergrad requirements: valid foreign passport, high-school diploma (SMA/SMU) or equivalent (notarized), transcripts, 2 recommendation letters, personal statement; admission via SAT/IB/A-Level/ACT exemption route or PKU secondary exam; language: many tracks are Chinese-taught (HSK6 typically expected) though some interdisciplinary options may include English-taught courses — check the EECS/Yuanpei program page for specifics.","duration":"4 years full-time (standard; interdisciplinary, may include study in EECS, Math and Yuanpei tracks)","fees":"RMB 30,000 per academic year (Science/Engineering band); confirm with EECS for program specifics.","courseDetail":"https://isd.pku.edu.cn/en/undergraduate_program.php","otherInstitution":"http://tiny.cc/vyxr001","scholarship":"https://isd.pku.edu.cn/en/scholarship.php"},
        {"course": "Physics","program":"Bachelor Degree","link":"https://english.phy.pku.edu.cn/About/Introduction.htm","entryRequirements":"PKU international undergraduate prerequisites: foreign passport, SMA diploma or equivalent (original/notarized), academic transcripts, 2 recommendation letters, personal statement; applicants may apply via standardized test routes (SAT/IB/A-Level/ACT) to waive written exams or take departmental assessments; Chinese-taught physics tracks normally expect HSK6 (≥200–210 for science subjects). Indonesian applicants should prepare notarized SMA documents and physics/math transcripts; contact School of Physics for any English-taught options.","duration":"4 years full-time (standard; can extend up to 6 years)","fees":"RMB 30,000 per academic year (Science & Engineering tuition band at PKU).","courseDetail":"https://isd.pku.edu.cn/en/undergraduate_program.php","otherInstitution":"http://tiny.cc/5zxr001","scholarship":"https://isd.pku.edu.cn/en/scholarship.php"},
        {"course": "Atmospheric Sciences","program":"Bachelor Degree","link":"https://english.phy.pku.edu.cn/About/Introduction.htm","entryRequirements":"Follow PKU international undergrad rules: non-Chinese citizenship, valid passport, SMA diploma (notarized) with transcripts, 2 recommendation letters, personal statement; applicants typically follow the standardized-test exemption route (SAT/IB/A-Level/ACT) or departmental assessments; Chinese instruction requires HSK6 (science threshold ~200+). Indonesian applicants should prepare SMA transcripts (physics/math background helpful) and valid passport/visa documents.","duration":"4 years full-time (standard)","fees":"RMB 30,000 per academic year (Science/Engineering band).","courseDetail":"https://isd.pku.edu.cn/en/undergraduate_program.php","otherInstitution":"http://tiny.cc/8zxr001","scholarship":"https://isd.pku.edu.cn/en/scholarship.php"},
        {"course": "Nuclear Physics (Nuclear Engineering and Nuclear Technology)","program":"Bachelor Degree","link":"https://english.phy.pku.edu.cn/About/Introduction.htm","entryRequirements":"PKU international undergrad requirements: non-Chinese passport, SMA diploma or equivalent (notarized), official transcripts, two recommendations, personal statement; admission via SAT/IB/A-Level/ACT exemption route or department secondary exam; Chinese-taught tracks normally require HSK6 (science threshold ~200+). Indonesian applicants should bring notarized SMA documents and any physics/math certificates; for nuclear programs confirm any extra screening or safety/health checks with the School of Physics.","duration":"4 years full-time (standard)","fees":"RMB 30,000 per academic year (Science & Engineering tuition band; program-specific fees may vary).","courseDetail":"https://isd.pku.edu.cn/en/undergraduate_program.php","otherInstitution":"http://tiny.cc/azxr001","scholarship":"https://isd.pku.edu.cn/en/scholarship.php"}
      
   
  ]
}
